package by.epam.one_dimentional_arrays_sorting;

import java.util.Arrays;

public class Task01 {
//	01. Заданы два одномерных массива с различным количеством элементов и натуральное число k. Объединить их в 
//	один  массив,  включив  второй  массив  между  k-м  и  (k+1)  -  м  элементами  первого.

	public static void main(String[] args) {
		int[] a1 = new int[] { 1, 2, 3, 4 };
		int[] a2 = new int[] { 5, 6, 7, 8, 9, 10 };
		int[] result = new int[a1.length + a2.length];

		System.out.println("Первый массив: " + Arrays.toString(a1));
		System.out.println("Второй массив: " + Arrays.toString(a2));

		int k = 1;

		///////////////////////////////////////////////////////////////////
		for (int i = 0; i <= k; i++) {
			result[i] = a1[i]; 				// переносим в новый массив элементы до индекса k из первого массива a1
		}
		///////////////////////////////////////////////////////////////////

		///////////////////////////////////////////////////////////////////
		int index1 = k + 1;
		for (int i = 0; i < a2.length; i++) {
			result[index1] = a2[i]; 		// продолжаем перенос элементов (всех) из массива a2 в новый массив
			index1++;
		}
		///////////////////////////////////////////////////////////////////

		///////////////////////////////////////////////////////////////////
		int index2 = k + 1;
		for (int i = 0; i < result.length; i++) {
			if (result[i] == 0) {
				result[i] = a1[index2]; 	// завершаем перенос элементов из массива a1 в новый массив (с индекса k+1)
				index2++;
			}
		}
		///////////////////////////////////////////////////////////////////

		System.out.println("Результат: " + Arrays.toString(result));

	}

}
